////아스키코드에대한실습
////아스키 코드 :ANSI에서 제시한 표준 코드 체계를 의미한다.
////C언어에서는 아스키코드를 사용하여 CPU가 알아들을수있도록 문자를 숫자로
////표현하는 코드체계이다
////0~127까지의 숫자들을 아라비아 숫자, 알파벳 대문자 ,알파벳소문자
////제어문자,화이트 스페이스등
////을 숫자로 매칭을 시켜놓은 것을 의미한다
//#include <stdio.h>
//#include <stdlib.h>
//
//int main(void)
//{//char 타입은 1바이트의 메모리 공간을 차지하며 문자를 나타내는 데이터타입
//	char ch1 = 'A';
//	char ch2 = 'B';
//	char ch3 = 'C';
//	printf("%c %c %c\n", ch1, ch2, ch3);
//	printf("%d %d %d\n", ch1, ch2, ch3);
//	char ch4 = 'a' - 'b' + 'c';
//	printf("% c\n", ch4);
//
//	return 0;
//}