////실수형 데이터의 자릿수 지정하여 출력하기 실습
//#include<stdio.h>
//#include<stdlib.h>
//
//int main(void)
//{
//	//system("title 실수형 데이터의 자리수 지정 형식");
//	//	//실수 소수점이 있는 숫자에서 자리수를 카운트 할때는 소수도 자릿수에 포함
//	//	printf("|%f|\n", 123.456789);
//	//	printf("|%0.2f|\n", 123.456789);
//	//	//소수 둘째자리까지 출력하기 반올림이 이루어진다
//	//	printf("|%6.1f|\n", 123.456789);
//	//	//전체 자릿수가 6개 소수점도 자릿수에 포함됨 소수 첫째 자리까지 출력
//	//	//기본적으로 오른쪽 정렬이 이루어진다
//	//	printf("|%-6.1f|\n", 123.456789);
//	//	printf("|%7.3f|\n", 123.456789);
//	//	printf("|%s|", "Cprogram");
//	//	printf("|%-s|", "Cprogram");
//	//	printf("|%-12s|\n", "C program");//문자열 끝에는 항상 특수기호가 붙는다
//	//	char str[15] = "C program!";
//	//	printf("%s", str);
//	//	printf("|%p|", "Cprogram");
//	return 0;
//}