////관계 연산자에 대한 실습
////관계연산자는 연산자를 기준으로 왼쪽과 오른쪽에 있는 두개의 피연산자를 비교하여
////참 , 거짓으로 결과를 표현해준다
////결과의 값이 참이면 양수의 대표값인 1 거짓이면 0을 출력한다
////관계연산자는 산술형자료나 수식에서만 사용이 가능하다.
//
//#include <stdio.h>
//
//int main(void)
//{
//	int a = 0, b = 0;
//	char ch1 = 'A';
//	char ch2 = 'B';
//	printf("첫번째 정수 입력");
//	scanf_s("%d", &a);
//
//	printf("두번째 정수 입력");
//	scanf_s("%d", &b);
//
//	printf("a==b : %d\n", a == b);
//	printf("a!=b : %d\n", a != b);
//	printf("a<b : %d\n", a < b);
//	printf("a>b : %d\n", a > b);
//	//부등호 기호를 쓸땐 부등호가 먼저 와야하며 공백이 들어오면 안된다
//
//
//
//
//
//	return 0;
//}