//#include <stdio.h>
////함수 원형 종류에 대한 실습 매개변수와 반환값이 모두 없는 함수
////매개변수와 반환값이 없는 사용자 정의 함수는 가장 간단하게 만들 수 있고 주로 용도는 간단한
////메시지를 출력하거나 단순한 명령문을 수행할때 사용한다.
//
//void ne();//문장을 출력하는 사용자 정의 함수 선언
//void dash();//equal을 출력하는 사용자 정의함수선언
//void dDash();
//int main(void)
//{//void 라는 것은 ~~이 없다, 공허한 사전적 의미를 지니고 있기 때문에 리턴타입이나 매개변수가 
//	//없을때
//	printf("매개변수와 반환값이 모두 없는 함수형\n");
//	dash();//함수호출
//	printf("사용자 정의 함수 ne()를 호출합니다.\n");
//	dash();
//	ne();
//	dash();
//	printf("프로그램을 종료합니다\n");
//	dash();//함수 호출
//	return 0;
//}
//void ne()
//{
//	printf("\n사용자 정의 함수 ne()영역이다\n\n");
//	return;
//}
//void dash()
//{
//	printf("===========================================\n");
//	return;
//}